### Pandas数据索引和选择

### Series 中的数据选择

In [7]:
import pandas as pd
data  = pd.Series([0.25,0.50,0.75,1.0],
                    index = ['a','b','c','d'])

In [8]:
data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [9]:
data['a']

0.25

In [11]:
'a' in data

True

In [12]:
data.keys()

Index([u'a', u'b', u'c', u'd'], dtype='object')

In [13]:
data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [14]:
data.values

array([0.25, 0.5 , 0.75, 1.  ])

In [17]:
data.items

<bound method Series.iteritems of a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64>

In [23]:
type(data.items)

instancemethod

In [24]:
data.items()

### 像字典一样在Series中添加数据

In [26]:
data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [27]:
data['e'] = 23

In [28]:
data

a     0.25
b     0.50
c     0.75
d     1.00
e    23.00
dtype: float64

### 按照索引来取值

In [30]:
data['a':'c']

a    0.25
b    0.50
c    0.75
dtype: float64

In [31]:
data[1:4]

b    0.50
c    0.75
d    1.00
dtype: float64

In [32]:
data[1:3]

b    0.50
c    0.75
dtype: float64

In [33]:
data

a     0.25
b     0.50
c     0.75
d     1.00
e    23.00
dtype: float64

In [34]:
data[(data>0.23) & (data< 0.5)]

a    0.25
dtype: float64

In [37]:
data[ ['a','e'] ]

a     0.25
e    23.00
dtype: float64

### loc 和iloc 显示索引和隐式索引的“冲突”问题

In [41]:
data = pd.Series(['a','c','e'],index = [1,2,3])

In [42]:
data

1    a
2    c
3    e
dtype: object

In [43]:
data[1]

'a'

In [48]:
data[0:3]

1    a
2    c
3    e
dtype: object

### loc 使用显式索引 - 1 就是第一个元素的索引

In [55]:
data

1    a
2    c
3    e
dtype: object

In [59]:
data.loc[1] # 第一个索引的位置

'a'

In [60]:
data.loc[2]

'c'

In [63]:
data.loc[1:3] # 1 - 3 索引的位置

1    a
2    c
3    e
dtype: object

### iloc 永远使用隐式索引

In [67]:
data.iloc[0] # 第一个值索引是0

'a'

## DataFrame 中的数据选择

### 字典式的数据选择

In [121]:
area = pd.Series({'California': 423967, 
                  'Texas': 695662, 
                  'New York': 141297,
                  'Florida': 170312,
                  'Illinois': 149995})
pops = pd.Series({'California': 38332521, 
                 'Texas': 26448193, 
                 'New York': 19651127, 
                 'Florida': 19552860,
                 'Illinois': 12882135})
data = pd.DataFrame({'area':area,'pops':pops})

In [122]:
area

California    423967
Florida       170312
Illinois      149995
New York      141297
Texas         695662
dtype: int64

In [131]:
pops

California    38332521
Florida       19552860
Illinois      12882135
New York      19651127
Texas         26448193
dtype: int64

In [124]:
data

              area      pops
California  423967  38332521
Florida     170312  19552860
Illinois    149995  12882135
New York    141297  19651127
Texas       695662  26448193

In [125]:
data['area']

California    423967
Florida       170312
Illinois      149995
New York      141297
Texas         695662
Name: area, dtype: int64

In [126]:
data.area

California    423967
Florida       170312
Illinois      149995
New York      141297
Texas         695662
Name: area, dtype: int64

In [127]:
data.pops

California    38332521
Florida       19552860
Illinois      12882135
New York      19651127
Texas         26448193
Name: pops, dtype: int64

In [128]:
data['pops']

California    38332521
Florida       19552860
Illinois      12882135
New York      19651127
Texas         26448193
Name: pops, dtype: int64

In [129]:
data.area is data['area']

True

In [134]:
data.pops is data['pops']

True

In [132]:
type(data.pop)

instancemethod

In [133]:
type(data.pops)

pandas.core.series.Series

### 使用字典的方式为DataFrame 添加一列数据

In [136]:
data['density'] = data['area']/data['pops']

In [150]:
data['densitey + 2'] = data['area']/data['pops'] + 1

In [151]:
data

              area      pops  densitey + 2
California  423967  38332521      1.011060
Florida     170312  19552860      1.008710
Illinois    149995  12882135      1.011644
New York    141297  19651127      1.007190
Texas       695662  26448193      1.026303

In [157]:
area = pd.Series({'California': 423967, 
                  'Texas': 695662, 
                  'New York': 141297,
                  'Florida': 170312,
                  'Illinois': 149995})
pops = pd.Series({'California': 38332521, 
                 'Texas': 26448193, 
                 'New York': 19651127, 
                 'Florida': 19552860,
                 'Illinois': 12882135})
data = pd.DataFrame({'area':area,'pops':pops})

In [162]:
data['New'] = data['area']/data['pops']

In [163]:
data.index

Index([u'California', u'Florida', u'Illinois', u'New York', u'Texas'], dtype='object')

In [164]:
data.values

array([[4.23967000e+05, 3.83325210e+07, 1.10602431e-02, 1.10602431e-02],
       [1.70312000e+05, 1.95528600e+07, 8.71033700e-03, 8.71033700e-03],
       [1.49995000e+05, 1.28821350e+07, 1.16436445e-02, 1.16436445e-02],
       [1.41297000e+05, 1.96511270e+07, 7.19027463e-03, 7.19027463e-03],
       [6.95662000e+05, 2.64481930e+07, 2.63028177e-02, 2.63028177e-02]])

In [165]:
data

              area      pops  newaddedcolumns       New
California  423967  38332521         0.011060  0.011060
Florida     170312  19552860         0.008710  0.008710
Illinois    149995  12882135         0.011644  0.011644
New York    141297  19651127         0.007190  0.007190
Texas       695662  26448193         0.026303  0.026303

### 转置运算

In [169]:
data.T

,California,Florida,Illinois,New York,Texas
area,4.239670e+05,1.703120e+05,1.499950e+05,1.412970e+05,6.956620e+05
pops,3.833252e+07,1.955286e+07,1.288214e+07,1.965113e+07,2.644819e+07
newaddedcolumns,1.106024e-02,8.710337e-03,1.164364e-02,7.190275e-03,2.630282e-02
New,1.106024e-02,8.710337e-03,1.164364e-02,7.190275e-03,2.630282e-02

In [189]:
data_T = data.T
data_T

,California,Florida,Illinois,New York,Texas
area,4.239670e+05,1.703120e+05,1.499950e+05,1.412970e+05,6.956620e+05
pops,3.833252e+07,1.955286e+07,1.288214e+07,1.965113e+07,2.644819e+07
newaddedcolumns,1.106024e-02,8.710337e-03,1.164364e-02,7.190275e-03,2.630282e-02
New,1.106024e-02,8.710337e-03,1.164364e-02,7.190275e-03,2.630282e-02

In [172]:
data_T.index

Index([u'area', u'pops', u'newaddedcolumns', u'New'], dtype='object')

In [173]:
data_T.columns

Index([u'California', u'Florida', u'Illinois', u'New York', u'Texas'], dtype='object')

In [177]:
data_T.values

array([[4.23967000e+05, 1.70312000e+05, 1.49995000e+05, 1.41297000e+05,
        6.95662000e+05],
       [3.83325210e+07, 1.95528600e+07, 1.28821350e+07, 1.96511270e+07,
        2.64481930e+07],
       [1.10602431e-02, 8.71033700e-03, 1.16436445e-02, 7.19027463e-03,
        2.63028177e-02],
       [1.10602431e-02, 8.71033700e-03, 1.16436445e-02, 7.19027463e-03,
        2.63028177e-02]])

In [186]:
data_T.values

array([[4.23967000e+05, 1.70312000e+05, 1.49995000e+05, 1.41297000e+05,
        6.95662000e+05],
       [3.83325210e+07, 1.95528600e+07, 1.28821350e+07, 1.96511270e+07,
        2.64481930e+07],
       [1.10602431e-02, 8.71033700e-03, 1.16436445e-02, 7.19027463e-03,
        2.63028177e-02],
       [1.10602431e-02, 8.71033700e-03, 1.16436445e-02, 7.19027463e-03,
        2.63028177e-02]])

In [179]:
data_T.values[0] # 取到第一行

array([423967., 170312., 149995., 141297., 695662.])

In [180]:
data_T.index

Index([u'area', u'pops', u'newaddedcolumns', u'New'], dtype='object')

In [181]:
data_T.index[1]

'pops'

In [185]:
data_T.iloc[1] # 隐式索引

California    38332521.0
Florida       19552860.0
Illinois      12882135.0
New York      19651127.0
Texas         26448193.0
Name: pops, dtype: float64

In [188]:
data_T.iloc[:3,:2]

                   California       Florida
area             4.239670e+05  1.703120e+05
pops             3.833252e+07  1.955286e+07
newaddedcolumns  1.106024e-02  8.710337e-03

In [197]:
data_T.loc[:'pops',:'New York']

      California     Florida    Illinois    New York
area    423967.0    170312.0    149995.0    141297.0
pops  38332521.0  19552860.0  12882135.0  19651127.0

In [198]:
data_T['China'] = data_T['Florida']/data_T['New York']

In [199]:
data_T

,California,Florida,Illinois,New York,Texas,China
area,4.239670e+05,1.703120e+05,1.499950e+05,1.412970e+05,6.956620e+05,1.205348
pops,3.833252e+07,1.955286e+07,1.288214e+07,1.965113e+07,2.644819e+07,0.994999
newaddedcolumns,1.106024e-02,8.710337e-03,1.164364e-02,7.190275e-03,2.630282e-02,1.211405
New,1.106024e-02,8.710337e-03,1.164364e-02,7.190275e-03,2.630282e-02,1.211405

In [201]:
data_T.loc[data_T.China > 1, ['Texas','Florida','Illinois'] ]

                         Texas       Florida       Illinois
area             695662.000000  170312.00000  149995.000000
newaddedcolumns       0.026303       0.00871       0.011644
New                   0.026303       0.00871       0.011644

### 按照行列索引来赋值

In [208]:
data_T.iloc[1,4] = 90

In [209]:
data_T

,California,Florida,Illinois,New York,Texas,China
area,4.239670e+05,1.703120e+05,9.000000e+01,1.412970e+05,695662.000000,1.205348
pops,3.833252e+07,1.955286e+07,1.288214e+07,1.965113e+07,90.000000,0.994999
newaddedcolumns,1.106024e-02,8.710337e-03,1.164364e-02,7.190275e-03,0.026303,1.211405
New,1.106024e-02,8.710337e-03,1.164364e-02,7.190275e-03,0.026303,1.211405

### 注意切片的方式主要是按照行

In [210]:
data_T

,California,Florida,Illinois,New York,Texas,China
area,4.239670e+05,1.703120e+05,9.000000e+01,1.412970e+05,695662.000000,1.205348
pops,3.833252e+07,1.955286e+07,1.288214e+07,1.965113e+07,90.000000,0.994999
newaddedcolumns,1.106024e-02,8.710337e-03,1.164364e-02,7.190275e-03,0.026303,1.211405
New,1.106024e-02,8.710337e-03,1.164364e-02,7.190275e-03,0.026303,1.211405

### 按照行索引

In [211]:
data_T['pops':'New']

,California,Florida,Illinois,New York,Texas,China
pops,3.833252e+07,1.955286e+07,1.288214e+07,1.965113e+07,90.000000,0.994999
newaddedcolumns,1.106024e-02,8.710337e-03,1.164364e-02,7.190275e-03,0.026303,1.211405
New,1.106024e-02,8.710337e-03,1.164364e-02,7.190275e-03,0.026303,1.211405

In [215]:
data_T[0:2] # row from 0 to 1

      California     Florida    Illinois    New York     Texas     China
area    423967.0    170312.0        90.0    141297.0  695662.0  1.205348
pops  38332521.0  19552860.0  12882135.0  19651127.0      90.0  0.994999

### 为了清晰间建议使用iloc and loc

In [221]:
data_T.loc['pops':'New']

,California,Florida,Illinois,New York,Texas,China
pops,3.833252e+07,1.955286e+07,1.288214e+07,1.965113e+07,90.000000,0.994999
newaddedcolumns,1.106024e-02,8.710337e-03,1.164364e-02,7.190275e-03,0.026303,1.211405
New,1.106024e-02,8.710337e-03,1.164364e-02,7.190275e-03,0.026303,1.211405

In [224]:
data_T.iloc[1:4]

,California,Florida,Illinois,New York,Texas,China
pops,3.833252e+07,1.955286e+07,1.288214e+07,1.965113e+07,90.000000,0.994999
newaddedcolumns,1.106024e-02,8.710337e-03,1.164364e-02,7.190275e-03,0.026303,1.211405
New,1.106024e-02,8.710337e-03,1.164364e-02,7.190275e-03,0.026303,1.211405

### 下面的操作也是按照行来选择的masking

In [227]:
data_T[data_T.China>1.2]

,California,Florida,Illinois,New York,Texas,China
area,423967.00000,170312.00000,90.000000,141297.00000,695662.000000,1.205348
newaddedcolumns,0.01106,0.00871,0.011644,0.00719,0.026303,1.211405
New,0.01106,0.00871,0.011644,0.00719,0.026303,1.211405